04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p2/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.523290435424846630e-03 -3.029665367928005511e-07 4.743418893013463597e-06)
(1.532725807651415337e-03 -1.962955281046109063e-07 4.781023985939310115e-06)
(1.538982578640266715e-03 -7.866780053704188005e-08 4.819090614290308889e-06)
(1.541929249771839972e-03 -3.148869568082481739e-08 4.846606161669757538e-06)
(1.541515499153522581e-03 5.832519754013991488e-09 4.867392793536018316e-06)
(1.537799849846101545e-03 9.004115245566567619e-08 4.891478439846596638e-06)
(1.530845254880624498e-03 2.244293203220509000e-07 4.925850244785307180e-06)
(1.520771873281977086e-03 3.537221687265814176e-07 4.976429080771171768e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}