04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p2/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
3.90064e-09
4.0988e-09
4.31305e-09
4.53602e-09
4.77137e-09
5.01842e-09
5.27281e-09
5.53837e-09
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
}


// ************************************************************************* //
